tuxmartin/meteotux/hardware/arduino/firmware/naprogramovani_do_atmelu/arduino_ide/hardware/arduino/boards.txt

# http://www.robertoinzerillo.com/wordpress/?p=45
### pridat na konec originalniho souboru:


##############################################################
#
#  Source: http://arduino.cc/forum/index.php?topic=116404,0
#  by Perhof (Sweden)
#
atmega8_opti_8mhz.name=ATmega8 Optiboot (8MHz internal OSC)
atmega8_opti_8mhz.upload.protocol=arduino
atmega8_opti_8mhz.upload.maximum_size=7680
atmega8_opti_8mhz.upload.speed=9600
atmega8_opti_8mhz.bootloader.low_fuses=0xa4
atmega8_opti_8mhz.bootloader.high_fuses=0xcc
atmega8_opti_8mhz.bootloader.path=optiboot_atmega8_8
atmega8_opti_8mhz.bootloader.file=optiboot_atmega8_8.hex
atmega8_opti_8mhz.bootloader.unlock_bits=0x3F
atmega8_opti_8mhz.bootloader.lock_bits=0x0F
atmega8_opti_8mhz.build.mcu=atmega8
atmega8_opti_8mhz.build.f_cpu=8000000L
atmega8_opti_8mhz.build.core=arduino
atmega8_opti_8mhz.build.variant=standard
#
##############################################################


